test-org/Allrun.pre
#!/bin/sh
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication gmshToFoam squarepipe.msh
runApplication topoSet
runApplication splitMeshRegions -cellZones -overwrite
sed -i 's/physicalType    patch; / /g' constant/polyMesh/boundary
# remove fluid fields from solid regions (important for post-processing)
for i in solid
do
   rm -f 0*/$i/{rho,nut,alphat,epsilon,k,U,p_rgh,Qr,G,IDefault}
done

for i in air solid
do
    runApplication -s $i  changeDictionary -region $i
done

#------------------------------------------------------------------------------
